tap "homebrew/bundle"
tap "homebrew/services"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "cryptography"
brew "readline"
brew "awscli"
brew "libyaml"
brew "awsume"
brew "azure-cli"
brew "bat"
brew "glib"
brew "cairo"
brew "cmake"
brew "direnv"
brew "eza"
brew "gmp"
brew "gcc"
brew "pmix"
brew "open-mpi"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "harfbuzz"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "git-secrets"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "grails"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "hdf5"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "lefthook"
brew "libmatio"
brew "libpq"
brew "make"
brew "mise"
brew "mysql"
brew "openjdk@11"
brew "openssl@1.1"
brew "peco"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@14", restart_service: true
brew "ruby-build"
brew "rbenv"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "supervisor"
brew "tmux"
brew "tree"
brew "vips"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
cask "aws-vault"
cask "bettertouchtool"
cask "figma"
cask "font-hack-nerd-font"
cask "gitify"
cask "monitorcontrol"
cask "raycast"
cask "tableplus"
cask "warp"
vscode "42crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "aliariff.vscode-erb-beautify"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "codelios.dartsass"
vscode "craigmaslowski.erb"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "dariofuzinato.vue-peek"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "frenco.vscode-notion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "groksrc.ruby"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ionutvmi.path-autocomplete"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kaiwood.endwise"
vscode "kevinrose.vsc-python-indent"
vscode "killalau.vscode-liquid-snippets"
vscode "maattdd.gitless"
vscode "manuelpuyol.erb-linter"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "neilbrayfield.php-docblocker"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rettimo.nextjs-vscode-snippets"
vscode "ritwickdey.liveserver"
vscode "sdras.vue-vscode-snippets"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sporto.rails-go-to-spec"
vscode "svipas.prettier-plus"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
